org/understanding_cycles.org
:PROPERTIES:
:ID:       7668edb8-65e7-4a56-a343-23a4d3d03a86
:END:
#+title: Understanding Cycles

- Cycles are not just a series of events in progression: they are often a progression of causative events
- Cyclical events are influenced by both endogenous events(cyclical events that
  precede them) and exogenous developments (occurring in other areas).
- A cycle's clout is heightened by the inability of investors to remember the past
- Cycles are viewed as less symmetrical than they are: the negatives are usually
  exaggerated

* Sources
- [[id:dd188129-5740-4141-a717-82796e10863b][Book: Mastering The Market Cycle]]
