content/posts/understanding_cycles.md
+++
title = "Understanding Cycles"
author = ["Jethro Kuan"]
draft = false
+++

-   Cycles are not just a series of events in progression: they are often a progression of causative events
-   Cyclical events are influenced by both endogenous events(cyclical events that
    precede them) and exogenous developments (occurring in other areas).
-   A cycle's clout is heightened by the inability of investors to remember the past
-   Cycles are viewed as less symmetrical than they are: the negatives are usually
    exaggerated


## Sources {#sources}

-   [Book: Mastering The Market Cycle]({{<relref "book_mastering_the_market_cycle.md#" >}})